<a href="https://colab.research.google.com/github/umbertocheriota/Python/blob/master/Big_data_final_movie_recomendation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 1. Загружаем файлы по оценкам (ratings) и фильмам (movies) и создаём на их основе pandas-датафреймы

In [1]:
import pandas as pd

In [2]:
df_ratings = pd.read_csv("u.data.csv", sep = '\t', names = ['user_id', 'item_id', 'rating', 'timestamp'])
df_ratings.head()

   user_id  item_id  rating  timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596

In [3]:
df_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   user_id    100000 non-null  int64
 1   item_id    100000 non-null  int64
 2   rating     100000 non-null  int64
 3   timestamp  100000 non-null  int64
dtypes: int64(4)
memory usage: 3.1 MB

In [4]:
df_movies = pd.read_csv("u.item.csv", sep = '|', header = None, encoding='latin-1')

In [5]:
df_movies.columns = ['movie_id','movie_title','release_date','video_release_date','imdb_url','unknown','action','adventure','animation','childrens','comedy','crime','documentary','drama','fantasy','film_noir','horror','musical','mystery','romance','sci_fi','thriller','war','western']
df_movies.head()

   movie_id        movie_title release_date  ...  thriller war  western
0         1   Toy Story (1995)  01-Jan-1995  ...         0   0        0
1         2   GoldenEye (1995)  01-Jan-1995  ...         1   0        0
2         3  Four Rooms (1995)  01-Jan-1995  ...         1   0        0
3         4  Get Shorty (1995)  01-Jan-1995  ...         0   0        0
4         5     Copycat (1995)  01-Jan-1995  ...         1   0        0

[5 rows x 24 columns]

In [6]:
df_movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1682 entries, 0 to 1681
Data columns (total 24 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   movie_id            1682 non-null   int64
 1   movie_title         1682 non-null   object
 2   release_date        1681 non-null   object
 3   video_release_date  0 non-null      float64
 4   imdb_url            1679 non-null   object
 5   unknown             1682 non-null   int64
 6   action              1682 non-null   int64
 7   adventure           1682 non-null   int64
 8   animation           1682 non-null   int64
 9   childrens           1682 non-null   int64
 10  comedy              1682 non-null   int64
 11  crime               1682 non-null   int64
 12  documentary         1682 non-null   int64
 13  drama               1682 non-null   int64
 14  fantasy             1682 non-null   int64
 15  film_noir           1682 non-null   int64
 16  horror              1682 non-null   int64
 17  musical             1682 non-null   int64
 18  mystery             1682 non-null   int64
 19  romance             1682 non-null   int64
 20  sci_fi              1682 non-null   int64
 21  thriller            1682 non-null   int64
 22  war                 1682 non-null   int64
 23  western             1682 non-null   int64
dtypes: float64(1), int64(20), object(3)
memory usage: 315.5+ KB

# 2. Для тестирования модели найдем юзера поставившего больше всего оценок

In [7]:
df_ratings[['user_id', 'rating']].groupby(['user_id']).count().sort_values(by='rating', ascending=False)

         rating
user_id
405         737
655         685
13          636
450         540
276         518
...         ...
685          20
475          20
36           20
732          20
596          20

[943 rows x 1 columns]

# 3. Отберем фильмы, которые оценил данный пользователь

In [8]:
df_ratings.head()

   user_id  item_id  rating  timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596

In [9]:
df_ratings.loc[df_ratings['user_id'] == 405]

       user_id  item_id  rating  timestamp
12276      405       56       4  885544911
12383      405      592       1  885548670
12430      405     1582       1  885548670
12449      405      171       1  885549544
12460      405      580       1  885547447
...        ...      ...     ...        ...
98956      405      375       1  885546835
98978      405      445       4  885548435
99148      405     1246       1  885547735
99465      405      196       1  885546112
99756      405      958       1  885549590

[737 rows x 4 columns]

# 4. Для построения модели нужны признаки, в качестве них будем использовать:

*   Год выхода
*   Жанры
*   Общее количество оценок
*   Суммарную оценку

In [10]:
# объединяем датафреймы
new_df = df_ratings.merge(df_movies, left_on='item_id', right_on='movie_id')
new_df.head()

   user_id  item_id  rating  timestamp  ...  sci_fi thriller war  western
0      196      242       3  881250949  ...       0        0   0        0
1       63      242       3  875747190  ...       0        0   0        0
2      226      242       5  883888671  ...       0        0   0        0
3      154      242       3  879138235  ...       0        0   0        0
4      306      242       5  876503793  ...       0        0   0        0

[5 rows x 28 columns]

In [11]:
new_df.columns

Index(['user_id', 'item_id', 'rating', 'timestamp', 'movie_id', 'movie_title',
       'release_date', 'video_release_date', 'imdb_url', 'unknown', 'action',
       'adventure', 'animation', 'childrens', 'comedy', 'crime', 'documentary',
       'drama', 'fantasy', 'film_noir', 'horror', 'musical', 'mystery',
       'romance', 'sci_fi', 'thriller', 'war', 'western'],
      dtype='object')

In [12]:
new_df = new_df[['user_id', 'item_id', 'rating', 'timestamp', 'unknown', 'action',
       'adventure', 'animation', 'childrens', 'comedy', 'crime', 'documentary',
       'drama', 'fantasy', 'film_noir', 'horror', 'musical', 'mystery',
       'romance', 'sci_fi', 'thriller', 'war', 'western']]

In [20]:
# добавляем столбец с количеством оценок на каждый фильм
new_df['rating_counts'] = new_df.groupby(['item_id'])['rating'].transform('count')

In [21]:
# добавляем столбец с суммой оценок на каждый фильм
new_df['rating_sum'] = new_df.groupby(['item_id'])['rating'].transform('sum')

# 5. Формируем X_train, X_test, y_train, y_test

In [26]:
X = new_df[['user_id', 'item_id']]
y = new_df['rating']

In [27]:
from sklearn.model_selection import train_test_split

In [28]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2)

# 6. Возьмём модель линейной регрессии и обучим ее на фильмах

In [30]:
from sklearn.linear_model import LinearRegression

In [31]:
model = LinearRegression()
model.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

#7. Оценим качество модели на X_test, y_test при помощи метрик для задачи регрессии

In [32]:
from sklearn.metrics import mean_squared_error

In [33]:
mean_squared_error(y_test, model.predict(X_test))

1.241729515892622